import functions

# d1 = float(input("Введите кратчайшее расстояние между спасателем и кромкой воды, d1 (ярды)" ))
# d2 = float(input("Введите кратчайшее расстояние от утопающего до берега, d2 (футы)"))
# h = float(input ("Введите боковое смещение между спасателем и утопающим, h (ярды)"))
# v_sand = float(input("Введите скорость движения спасателя по песку, v_sand (мили в час)" ))
# n = float(input ("Введите коэффициент замедления спасателя при движении в воде, n" ))
# theta1 = float(input ("Введите направление движения спасателя по песку, theta1 (градусы)"))
#
#
# functions.time_way(d1, d2, h, v_sand, n, theta1)


functions.time_way(8, 10, 50, 5, 2, 39.413)
input("Press Enter")